# Друге завдання
#
# Щоб виграти головний приз лотереї, необхідний збіг кількох номерів на
# лотерейному квитку з числами, що випали випадковим чином і в певному
# діапазоні під час чергового тиражу. Наприклад, необхідно вгадати шість
# чисел від 1 до 49 чи п'ять чисел від 1 до 36 тощо.
#
# Вам необхідно написати функцію get_numbers_ticket(min, max, quantity),
# яка допоможе генерувати набір унікальних випадкових чисел для таких лотерей.
#
# Вона буде повертати випадковий набір чисел у межах заданих параметрів,
# причому всі випадкові числа в наборі повинні бути унікальні.
#
# Вимоги до завдання:
#
# Параметри функції:
# min - мінімальне можливе число у наборі (не менше 1).
# max - максимальне можливе число у наборі (не більше 1000).
# quantity - кількість чисел, які потрібно вибрати (значення між min і max).
# Функція генерує вказану кількість унікальних чисел у заданому діапазоні.
# Функція повертає список випадково вибраних, відсортованих чисел. Числа в наборі
# не повинні повторюватися. Якщо параметри не відповідають заданим обмеженням,
# функція повертає пустий список.

import random

def get_numbers_ticket(min, max, quantity):
    if min < 1:  # min - мінімальне можливе число у наборі (не менше 1).
        return []
    elif max > 1000:  # max - максимальне можливе число у наборі (не більше 1000).
        return []
    elif min >= max:  # min не менше за max
        return []
    elif quantity < min or quantity > max - min + 1:  # quantity в межах діапазону
        return []
    else:
        return sorted(random.sample(range(min, max+1), quantity))  # повернення списку включно з максимальним значенням діапазону

lottery_numbers = get_numbers_ticket(1, 49, 6)
print("Ваші лотерейні числа:", lottery_numbers)
