# Перше завдання
#
# Створіть функцію get_days_from_today(date), яка розраховує кількість днів між заданою датою і поточною датою.
#
# Вимоги до завдання:
#
# Функція приймає один параметр: date — рядок, що представляє дату у форматі 'РРРР-ММ-ДД' (наприклад, '2020-10-09').
# Функція повертає ціле число, яке вказує на кількість днів від заданої дати до поточної. Якщо задана дата пізніша за поточну, результат має бути від'ємним.
# У розрахунках необхідно враховувати лише дні, ігноруючи час (години, хвилини, секунди).
# Для роботи з датами слід використовувати модуль datetime Python.

import datetime

"""Для вводу даних використовуємо цикл while True для обробки винятків"""

while True:
    try:
        date = input("Введіть необхідну дату для розрахунку кількості днів до "
                     "поточної дати у форматі 'РРРР-ММ-ДД': ")
        date = datetime.datetime.strptime(date, '%Y-%m-%d').date()
        break
    except ValueError:
        print("Дату введено некоректно.")

def get_days_from_today(date):
    """В цій функції визначається теперішня дата, наступним кроком віднімаємо
    теперішню дату від заданої користувачем, після чого обробляємо результат
    для виводу сповіщення"""
    current_date = datetime.datetime.today().date()
    days_delta = current_date - date
    if days_delta.days > 0:
        print(f"Від {date} до сьогоднішні пройшло {days_delta.days} днів")
    elif days_delta.days == 0:
        print("Ви ввели сьогоднішню дату.")
    else:
        print(f"Від сьогодні до {date} потрібно почекати "
              f"{days_delta.days * (-1)} днів")
    return print(days_delta.days) # для повернення потрібно тільки return days_delta.days

get_days_from_today(date)